Microchip-MPLAB-Harmony/usb_apps_device/apps/vendor/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/shdwc.h
/* -------- SHDW_SR : (SHDWC Offset: 0x08) ( R/ 32) Shutdown Status Register -------- */
#define SHDW_SR_WKUPS_Pos                     _UINT32_(0)                                          /* (SHDW_SR) PIOBU, WKUP Wake-up Status Position */
#define SHDW_SR_WKUPS_Msk                     (_UINT32_(0x1) << SHDW_SR_WKUPS_Pos)                 /* (SHDW_SR) PIOBU, WKUP Wake-up Status Mask */
#define SHDW_SR_WKUPS(value)                  (SHDW_SR_WKUPS_Msk & (_UINT32_(value) << SHDW_SR_WKUPS_Pos)) /* Assigment of value for WKUPS in the SHDW_SR register */
#define   SHDW_SR_WKUPS_NO_Val                _UINT32_(0x0)                                        /* (SHDW_SR) No wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR.  */
#define   SHDW_SR_WKUPS_PRESENT_Val           _UINT32_(0x1)                                        /* (SHDW_SR) At least one wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR.  */
#define SHDW_SR_WKUPS_NO                      (SHDW_SR_WKUPS_NO_Val << SHDW_SR_WKUPS_Pos)          /* (SHDW_SR) No wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR. Position  */
#define SHDW_SR_WKUPS_PRESENT                 (SHDW_SR_WKUPS_PRESENT_Val << SHDW_SR_WKUPS_Pos)     /* (SHDW_SR) At least one wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR. Position  */
#define SHDW_SR_RTCWK_Pos                     _UINT32_(5)                                          /* (SHDW_SR)  Position */
#define SHDW_SR_RTCWK_Msk                     (_UINT32_(0x1) << SHDW_SR_RTCWK_Pos)                 /* (SHDW_SR)  Mask */
#define SHDW_SR_RTCWK(value)                  (SHDW_SR_RTCWK_Msk & (_UINT32_(value) << SHDW_SR_RTCWK_Pos)) /* Assigment of value for RTCWK in the SHDW_SR register */
#define SHDW_SR_ACCWK_Pos                     _UINT32_(6)                                          /* (SHDW_SR) Analog Comparator Controller Wake-up Position */
#define SHDW_SR_ACCWK_Msk                     (_UINT32_(0x1) << SHDW_SR_ACCWK_Pos)                 /* (SHDW_SR) Analog Comparator Controller Wake-up Mask */
#define SHDW_SR_ACCWK(value)                  (SHDW_SR_ACCWK_Msk & (_UINT32_(value) << SHDW_SR_ACCWK_Pos)) /* Assigment of value for ACCWK in the SHDW_SR register */
#define SHDW_SR_RXLPWK_Pos                    _UINT32_(7)                                          /* (SHDW_SR) Debug Unit Wake-up Position */
#define SHDW_SR_RXLPWK_Msk                    (_UINT32_(0x1) << SHDW_SR_RXLPWK_Pos)                /* (SHDW_SR) Debug Unit Wake-up Mask */
#define SHDW_SR_RXLPWK(value)                 (SHDW_SR_RXLPWK_Msk & (_UINT32_(value) << SHDW_SR_RXLPWK_Pos)) /* Assigment of value for RXLPWK in the SHDW_SR register */
#define SHDW_SR_WKUPIS0_Pos                   _UINT32_(16)                                         /* (SHDW_SR) Wake-up 0 Input Status Position */
#define SHDW_SR_WKUPIS0_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS0_Pos)               /* (SHDW_SR) Wake-up 0 Input Status Mask */
#define SHDW_SR_WKUPIS0(value)                (SHDW_SR_WKUPIS0_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS0_Pos)) /* Assigment of value for WKUPIS0 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS0_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS0_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS0_DISABLE               (SHDW_SR_WKUPIS0_DISABLE_Val << SHDW_SR_WKUPIS0_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS0_ENABLE                (SHDW_SR_WKUPIS0_ENABLE_Val << SHDW_SR_WKUPIS0_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS1_Pos                   _UINT32_(17)                                         /* (SHDW_SR) Wake-up 1 Input Status Position */
#define SHDW_SR_WKUPIS1_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS1_Pos)               /* (SHDW_SR) Wake-up 1 Input Status Mask */
#define SHDW_SR_WKUPIS1(value)                (SHDW_SR_WKUPIS1_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS1_Pos)) /* Assigment of value for WKUPIS1 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS1_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS1_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS1_DISABLE               (SHDW_SR_WKUPIS1_DISABLE_Val << SHDW_SR_WKUPIS1_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS1_ENABLE                (SHDW_SR_WKUPIS1_ENABLE_Val << SHDW_SR_WKUPIS1_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS2_Pos                   _UINT32_(18)                                         /* (SHDW_SR) Wake-up 2 Input Status Position */
#define SHDW_SR_WKUPIS2_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS2_Pos)               /* (SHDW_SR) Wake-up 2 Input Status Mask */
#define SHDW_SR_WKUPIS2(value)                (SHDW_SR_WKUPIS2_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS2_Pos)) /* Assigment of value for WKUPIS2 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS2_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS2_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS2_DISABLE               (SHDW_SR_WKUPIS2_DISABLE_Val << SHDW_SR_WKUPIS2_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS2_ENABLE                (SHDW_SR_WKUPIS2_ENABLE_Val << SHDW_SR_WKUPIS2_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS3_Pos                   _UINT32_(19)                                         /* (SHDW_SR) Wake-up 3 Input Status Position */
#define SHDW_SR_WKUPIS3_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS3_Pos)               /* (SHDW_SR) Wake-up 3 Input Status Mask */
#define SHDW_SR_WKUPIS3(value)                (SHDW_SR_WKUPIS3_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS3_Pos)) /* Assigment of value for WKUPIS3 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS3_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS3_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS3_DISABLE               (SHDW_SR_WKUPIS3_DISABLE_Val << SHDW_SR_WKUPIS3_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS3_ENABLE                (SHDW_SR_WKUPIS3_ENABLE_Val << SHDW_SR_WKUPIS3_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS4_Pos                   _UINT32_(20)                                         /* (SHDW_SR) Wake-up 4 Input Status Position */
#define SHDW_SR_WKUPIS4_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS4_Pos)               /* (SHDW_SR) Wake-up 4 Input Status Mask */
#define SHDW_SR_WKUPIS4(value)                (SHDW_SR_WKUPIS4_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS4_Pos)) /* Assigment of value for WKUPIS4 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS4_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS4_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS4_DISABLE               (SHDW_SR_WKUPIS4_DISABLE_Val << SHDW_SR_WKUPIS4_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS4_ENABLE                (SHDW_SR_WKUPIS4_ENABLE_Val << SHDW_SR_WKUPIS4_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS5_Pos                   _UINT32_(21)                                         /* (SHDW_SR) Wake-up 5 Input Status Position */
#define SHDW_SR_WKUPIS5_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS5_Pos)               /* (SHDW_SR) Wake-up 5 Input Status Mask */
#define SHDW_SR_WKUPIS5(value)                (SHDW_SR_WKUPIS5_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS5_Pos)) /* Assigment of value for WKUPIS5 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS5_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS5_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS5_DISABLE               (SHDW_SR_WKUPIS5_DISABLE_Val << SHDW_SR_WKUPIS5_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS5_ENABLE                (SHDW_SR_WKUPIS5_ENABLE_Val << SHDW_SR_WKUPIS5_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS6_Pos                   _UINT32_(22)                                         /* (SHDW_SR) Wake-up 6 Input Status Position */
#define SHDW_SR_WKUPIS6_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS6_Pos)               /* (SHDW_SR) Wake-up 6 Input Status Mask */
#define SHDW_SR_WKUPIS6(value)                (SHDW_SR_WKUPIS6_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS6_Pos)) /* Assigment of value for WKUPIS6 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS6_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS6_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS6_DISABLE               (SHDW_SR_WKUPIS6_DISABLE_Val << SHDW_SR_WKUPIS6_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS6_ENABLE                (SHDW_SR_WKUPIS6_ENABLE_Val << SHDW_SR_WKUPIS6_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS7_Pos                   _UINT32_(23)                                         /* (SHDW_SR) Wake-up 7 Input Status Position */
#define SHDW_SR_WKUPIS7_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS7_Pos)               /* (SHDW_SR) Wake-up 7 Input Status Mask */
#define SHDW_SR_WKUPIS7(value)                (SHDW_SR_WKUPIS7_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS7_Pos)) /* Assigment of value for WKUPIS7 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS7_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS7_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS7_DISABLE               (SHDW_SR_WKUPIS7_DISABLE_Val << SHDW_SR_WKUPIS7_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS7_ENABLE                (SHDW_SR_WKUPIS7_ENABLE_Val << SHDW_SR_WKUPIS7_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS8_Pos                   _UINT32_(24)                                         /* (SHDW_SR) Wake-up 8 Input Status Position */
#define SHDW_SR_WKUPIS8_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS8_Pos)               /* (SHDW_SR) Wake-up 8 Input Status Mask */
#define SHDW_SR_WKUPIS8(value)                (SHDW_SR_WKUPIS8_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS8_Pos)) /* Assigment of value for WKUPIS8 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS8_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS8_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS8_DISABLE               (SHDW_SR_WKUPIS8_DISABLE_Val << SHDW_SR_WKUPIS8_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS8_ENABLE                (SHDW_SR_WKUPIS8_ENABLE_Val << SHDW_SR_WKUPIS8_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS9_Pos                   _UINT32_(25)                                         /* (SHDW_SR) Wake-up 9 Input Status Position */
#define SHDW_SR_WKUPIS9_Msk                   (_UINT32_(0x1) << SHDW_SR_WKUPIS9_Pos)               /* (SHDW_SR) Wake-up 9 Input Status Mask */
#define SHDW_SR_WKUPIS9(value)                (SHDW_SR_WKUPIS9_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS9_Pos)) /* Assigment of value for WKUPIS9 in the SHDW_SR register */
#define   SHDW_SR_WKUPIS9_DISABLE_Val         _UINT32_(0x0)                                        /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SHDW_SR_WKUPIS9_ENABLE_Val          _UINT32_(0x1)                                        /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.  */
#define SHDW_SR_WKUPIS9_DISABLE               (SHDW_SR_WKUPIS9_DISABLE_Val << SHDW_SR_WKUPIS9_Pos) /* (SHDW_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_WKUPIS9_ENABLE                (SHDW_SR_WKUPIS9_ENABLE_Val << SHDW_SR_WKUPIS9_Pos)  /* (SHDW_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event. Position  */
#define SHDW_SR_Msk                           _UINT32_(0x03FF00E1)                                 /* (SHDW_SR) Register Mask  */

