Microchip-MPLAB-Harmony/usb_apps_device/apps/vendor/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/shdwc.h
#define SHDW_SR_WKUPIS_Pos                    _UINT32_(16)                                         /* (SHDW_SR Position) Wake-up 9 Input Status */
#define SHDW_SR_WKUPIS_Msk                    (_UINT32_(0x3FF) << SHDW_SR_WKUPIS_Pos)              /* (SHDW_SR Mask) WKUPIS */
#define SHDW_SR_WKUPIS(value)                 (SHDW_SR_WKUPIS_Msk & (_UINT32_(value) << SHDW_SR_WKUPIS_Pos)) 

/* -------- SHDW_WUIR : (SHDWC Offset: 0x0C) (R/W 32) Shutdown Wake-up Inputs Register -------- */
#define SHDW_WUIR_WKUPEN0_Pos                 _UINT32_(0)                                          /* (SHDW_WUIR) Wake-up 0 Input Enable Position */
#define SHDW_WUIR_WKUPEN0_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN0_Pos)             /* (SHDW_WUIR) Wake-up 0 Input Enable Mask */
#define SHDW_WUIR_WKUPEN0(value)              (SHDW_WUIR_WKUPEN0_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN0_Pos)) /* Assigment of value for WKUPEN0 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN0_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN0_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN0_DISABLE             (SHDW_WUIR_WKUPEN0_DISABLE_Val << SHDW_WUIR_WKUPEN0_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN0_ENABLE              (SHDW_WUIR_WKUPEN0_ENABLE_Val << SHDW_WUIR_WKUPEN0_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN1_Pos                 _UINT32_(1)                                          /* (SHDW_WUIR) Wake-up 1 Input Enable Position */
#define SHDW_WUIR_WKUPEN1_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN1_Pos)             /* (SHDW_WUIR) Wake-up 1 Input Enable Mask */
#define SHDW_WUIR_WKUPEN1(value)              (SHDW_WUIR_WKUPEN1_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN1_Pos)) /* Assigment of value for WKUPEN1 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN1_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN1_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN1_DISABLE             (SHDW_WUIR_WKUPEN1_DISABLE_Val << SHDW_WUIR_WKUPEN1_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN1_ENABLE              (SHDW_WUIR_WKUPEN1_ENABLE_Val << SHDW_WUIR_WKUPEN1_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN2_Pos                 _UINT32_(2)                                          /* (SHDW_WUIR) Wake-up 2 Input Enable Position */
#define SHDW_WUIR_WKUPEN2_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN2_Pos)             /* (SHDW_WUIR) Wake-up 2 Input Enable Mask */
#define SHDW_WUIR_WKUPEN2(value)              (SHDW_WUIR_WKUPEN2_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN2_Pos)) /* Assigment of value for WKUPEN2 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN2_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN2_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN2_DISABLE             (SHDW_WUIR_WKUPEN2_DISABLE_Val << SHDW_WUIR_WKUPEN2_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN2_ENABLE              (SHDW_WUIR_WKUPEN2_ENABLE_Val << SHDW_WUIR_WKUPEN2_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN3_Pos                 _UINT32_(3)                                          /* (SHDW_WUIR) Wake-up 3 Input Enable Position */
#define SHDW_WUIR_WKUPEN3_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN3_Pos)             /* (SHDW_WUIR) Wake-up 3 Input Enable Mask */
#define SHDW_WUIR_WKUPEN3(value)              (SHDW_WUIR_WKUPEN3_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN3_Pos)) /* Assigment of value for WKUPEN3 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN3_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN3_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN3_DISABLE             (SHDW_WUIR_WKUPEN3_DISABLE_Val << SHDW_WUIR_WKUPEN3_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN3_ENABLE              (SHDW_WUIR_WKUPEN3_ENABLE_Val << SHDW_WUIR_WKUPEN3_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN4_Pos                 _UINT32_(4)                                          /* (SHDW_WUIR) Wake-up 4 Input Enable Position */
#define SHDW_WUIR_WKUPEN4_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN4_Pos)             /* (SHDW_WUIR) Wake-up 4 Input Enable Mask */
#define SHDW_WUIR_WKUPEN4(value)              (SHDW_WUIR_WKUPEN4_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN4_Pos)) /* Assigment of value for WKUPEN4 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN4_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN4_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN4_DISABLE             (SHDW_WUIR_WKUPEN4_DISABLE_Val << SHDW_WUIR_WKUPEN4_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN4_ENABLE              (SHDW_WUIR_WKUPEN4_ENABLE_Val << SHDW_WUIR_WKUPEN4_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN5_Pos                 _UINT32_(5)                                          /* (SHDW_WUIR) Wake-up 5 Input Enable Position */
#define SHDW_WUIR_WKUPEN5_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN5_Pos)             /* (SHDW_WUIR) Wake-up 5 Input Enable Mask */
#define SHDW_WUIR_WKUPEN5(value)              (SHDW_WUIR_WKUPEN5_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN5_Pos)) /* Assigment of value for WKUPEN5 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN5_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN5_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN5_DISABLE             (SHDW_WUIR_WKUPEN5_DISABLE_Val << SHDW_WUIR_WKUPEN5_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN5_ENABLE              (SHDW_WUIR_WKUPEN5_ENABLE_Val << SHDW_WUIR_WKUPEN5_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN6_Pos                 _UINT32_(6)                                          /* (SHDW_WUIR) Wake-up 6 Input Enable Position */
#define SHDW_WUIR_WKUPEN6_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN6_Pos)             /* (SHDW_WUIR) Wake-up 6 Input Enable Mask */
#define SHDW_WUIR_WKUPEN6(value)              (SHDW_WUIR_WKUPEN6_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN6_Pos)) /* Assigment of value for WKUPEN6 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN6_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN6_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN6_DISABLE             (SHDW_WUIR_WKUPEN6_DISABLE_Val << SHDW_WUIR_WKUPEN6_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN6_ENABLE              (SHDW_WUIR_WKUPEN6_ENABLE_Val << SHDW_WUIR_WKUPEN6_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN7_Pos                 _UINT32_(7)                                          /* (SHDW_WUIR) Wake-up 7 Input Enable Position */
#define SHDW_WUIR_WKUPEN7_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN7_Pos)             /* (SHDW_WUIR) Wake-up 7 Input Enable Mask */
#define SHDW_WUIR_WKUPEN7(value)              (SHDW_WUIR_WKUPEN7_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN7_Pos)) /* Assigment of value for WKUPEN7 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN7_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN7_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN7_DISABLE             (SHDW_WUIR_WKUPEN7_DISABLE_Val << SHDW_WUIR_WKUPEN7_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN7_ENABLE              (SHDW_WUIR_WKUPEN7_ENABLE_Val << SHDW_WUIR_WKUPEN7_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN8_Pos                 _UINT32_(8)                                          /* (SHDW_WUIR) Wake-up 8 Input Enable Position */
#define SHDW_WUIR_WKUPEN8_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN8_Pos)             /* (SHDW_WUIR) Wake-up 8 Input Enable Mask */
#define SHDW_WUIR_WKUPEN8(value)              (SHDW_WUIR_WKUPEN8_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN8_Pos)) /* Assigment of value for WKUPEN8 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN8_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN8_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN8_DISABLE             (SHDW_WUIR_WKUPEN8_DISABLE_Val << SHDW_WUIR_WKUPEN8_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN8_ENABLE              (SHDW_WUIR_WKUPEN8_ENABLE_Val << SHDW_WUIR_WKUPEN8_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPEN9_Pos                 _UINT32_(9)                                          /* (SHDW_WUIR) Wake-up 9 Input Enable Position */
#define SHDW_WUIR_WKUPEN9_Msk                 (_UINT32_(0x1) << SHDW_WUIR_WKUPEN9_Pos)             /* (SHDW_WUIR) Wake-up 9 Input Enable Mask */
#define SHDW_WUIR_WKUPEN9(value)              (SHDW_WUIR_WKUPEN9_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPEN9_Pos)) /* Assigment of value for WKUPEN9 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPEN9_DISABLE_Val       _UINT32_(0x0)                                        /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect.  */
#define   SHDW_WUIR_WKUPEN9_ENABLE_Val        _UINT32_(0x1)                                        /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPEN9_DISABLE             (SHDW_WUIR_WKUPEN9_DISABLE_Val << SHDW_WUIR_WKUPEN9_Pos) /* (SHDW_WUIR) The corresponding wake-up input has no wake-up effect. Position  */
#define SHDW_WUIR_WKUPEN9_ENABLE              (SHDW_WUIR_WKUPEN9_ENABLE_Val << SHDW_WUIR_WKUPEN9_Pos) /* (SHDW_WUIR) The corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT0_Pos                  _UINT32_(16)                                         /* (SHDW_WUIR) Wake-up 0 Input Type Position */
#define SHDW_WUIR_WKUPT0_Msk                  (_UINT32_(0x1) << SHDW_WUIR_WKUPT0_Pos)              /* (SHDW_WUIR) Wake-up 0 Input Type Mask */
#define SHDW_WUIR_WKUPT0(value)               (SHDW_WUIR_WKUPT0_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPT0_Pos)) /* Assigment of value for WKUPT0 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPT0_LOW_Val            _UINT32_(0x0)                                        /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT0_HIGH_Val           _UINT32_(0x1)                                        /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT0_LOW                  (SHDW_WUIR_WKUPT0_LOW_Val << SHDW_WUIR_WKUPT0_Pos)   /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT0_HIGH                 (SHDW_WUIR_WKUPT0_HIGH_Val << SHDW_WUIR_WKUPT0_Pos)  /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT1_Pos                  _UINT32_(17)                                         /* (SHDW_WUIR) Wake-up 1 Input Type Position */
#define SHDW_WUIR_WKUPT1_Msk                  (_UINT32_(0x1) << SHDW_WUIR_WKUPT1_Pos)              /* (SHDW_WUIR) Wake-up 1 Input Type Mask */
#define SHDW_WUIR_WKUPT1(value)               (SHDW_WUIR_WKUPT1_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPT1_Pos)) /* Assigment of value for WKUPT1 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPT1_LOW_Val            _UINT32_(0x0)                                        /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT1_HIGH_Val           _UINT32_(0x1)                                        /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT1_LOW                  (SHDW_WUIR_WKUPT1_LOW_Val << SHDW_WUIR_WKUPT1_Pos)   /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT1_HIGH                 (SHDW_WUIR_WKUPT1_HIGH_Val << SHDW_WUIR_WKUPT1_Pos)  /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT2_Pos                  _UINT32_(18)                                         /* (SHDW_WUIR) Wake-up 2 Input Type Position */
#define SHDW_WUIR_WKUPT2_Msk                  (_UINT32_(0x1) << SHDW_WUIR_WKUPT2_Pos)              /* (SHDW_WUIR) Wake-up 2 Input Type Mask */
#define SHDW_WUIR_WKUPT2(value)               (SHDW_WUIR_WKUPT2_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPT2_Pos)) /* Assigment of value for WKUPT2 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPT2_LOW_Val            _UINT32_(0x0)                                        /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT2_HIGH_Val           _UINT32_(0x1)                                        /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT2_LOW                  (SHDW_WUIR_WKUPT2_LOW_Val << SHDW_WUIR_WKUPT2_Pos)   /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT2_HIGH                 (SHDW_WUIR_WKUPT2_HIGH_Val << SHDW_WUIR_WKUPT2_Pos)  /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT3_Pos                  _UINT32_(19)                                         /* (SHDW_WUIR) Wake-up 3 Input Type Position */
#define SHDW_WUIR_WKUPT3_Msk                  (_UINT32_(0x1) << SHDW_WUIR_WKUPT3_Pos)              /* (SHDW_WUIR) Wake-up 3 Input Type Mask */
#define SHDW_WUIR_WKUPT3(value)               (SHDW_WUIR_WKUPT3_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPT3_Pos)) /* Assigment of value for WKUPT3 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPT3_LOW_Val            _UINT32_(0x0)                                        /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT3_HIGH_Val           _UINT32_(0x1)                                        /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT3_LOW                  (SHDW_WUIR_WKUPT3_LOW_Val << SHDW_WUIR_WKUPT3_Pos)   /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT3_HIGH                 (SHDW_WUIR_WKUPT3_HIGH_Val << SHDW_WUIR_WKUPT3_Pos)  /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT4_Pos                  _UINT32_(20)                                         /* (SHDW_WUIR) Wake-up 4 Input Type Position */
#define SHDW_WUIR_WKUPT4_Msk                  (_UINT32_(0x1) << SHDW_WUIR_WKUPT4_Pos)              /* (SHDW_WUIR) Wake-up 4 Input Type Mask */
#define SHDW_WUIR_WKUPT4(value)               (SHDW_WUIR_WKUPT4_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPT4_Pos)) /* Assigment of value for WKUPT4 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPT4_LOW_Val            _UINT32_(0x0)                                        /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT4_HIGH_Val           _UINT32_(0x1)                                        /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT4_LOW                  (SHDW_WUIR_WKUPT4_LOW_Val << SHDW_WUIR_WKUPT4_Pos)   /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT4_HIGH                 (SHDW_WUIR_WKUPT4_HIGH_Val << SHDW_WUIR_WKUPT4_Pos)  /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT5_Pos                  _UINT32_(21)                                         /* (SHDW_WUIR) Wake-up 5 Input Type Position */
#define SHDW_WUIR_WKUPT5_Msk                  (_UINT32_(0x1) << SHDW_WUIR_WKUPT5_Pos)              /* (SHDW_WUIR) Wake-up 5 Input Type Mask */
#define SHDW_WUIR_WKUPT5(value)               (SHDW_WUIR_WKUPT5_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPT5_Pos)) /* Assigment of value for WKUPT5 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPT5_LOW_Val            _UINT32_(0x0)                                        /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT5_HIGH_Val           _UINT32_(0x1)                                        /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT5_LOW                  (SHDW_WUIR_WKUPT5_LOW_Val << SHDW_WUIR_WKUPT5_Pos)   /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT5_HIGH                 (SHDW_WUIR_WKUPT5_HIGH_Val << SHDW_WUIR_WKUPT5_Pos)  /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT6_Pos                  _UINT32_(22)                                         /* (SHDW_WUIR) Wake-up 6 Input Type Position */
#define SHDW_WUIR_WKUPT6_Msk                  (_UINT32_(0x1) << SHDW_WUIR_WKUPT6_Pos)              /* (SHDW_WUIR) Wake-up 6 Input Type Mask */
#define SHDW_WUIR_WKUPT6(value)               (SHDW_WUIR_WKUPT6_Msk & (_UINT32_(value) << SHDW_WUIR_WKUPT6_Pos)) /* Assigment of value for WKUPT6 in the SHDW_WUIR register */
#define   SHDW_WUIR_WKUPT6_LOW_Val            _UINT32_(0x0)                                        /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SHDW_WUIR_WKUPT6_HIGH_Val           _UINT32_(0x1)                                        /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SHDW_WUIR_WKUPT6_LOW                  (SHDW_WUIR_WKUPT6_LOW_Val << SHDW_WUIR_WKUPT6_Pos)   /* (SHDW_WUIR) A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT6_HIGH                 (SHDW_WUIR_WKUPT6_HIGH_Val << SHDW_WUIR_WKUPT6_Pos)  /* (SHDW_WUIR) A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SHDW_WUIR_WKUPT7_Pos                  _UINT32_(23)                                         /* (SHDW_WUIR) Wake-up 7 Input Type Position */
